app/controllers/home_controller.rb

  def friends
    @friends = []
    unless friend_list.blank?
      friend_list.each do |f|
        @friends << User.find_by_id(f)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def user_list
    @users = User.all
    @friend_list = friend_list
    @block_list = block_list
    unless params[:add_friend].blank?
      @friend_list << params[:add_friend]
      current_user.update(friend_list: @friend_list.join(" "))
---
SELECT "users".* FROM "users"
UPDATE "users" SET "friend_list" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["friend_list", "3 2"], ["updated_at", "2016-03-19 18:05:26.208667"], ["id", 1]]