app/controllers/home_controller.rb

SELECT "users".* FROM "users"
UPDATE "users" SET "friend_list" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["friend_list", "1 2 2"], ["updated_at", "2016-03-19 05:36:40.617574"], ["id", 4]]
---
  def add_friend
    @users = User.all
    @friend_list = friend_list
    unless params[:add_friend].blank?
      @friend_list << params[:add_friend]
      current_user.update(friend_list: @friend_list.join(" "))