app/controllers/messages_controller.rb

  def new
    @message = current_user.messages.new
    unless params[:recipient_email].blank?
      @recipient = User.find_by_email(params[:recipient_email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hieu2@gmail.com"]]

  def create
    if email_params.blank?
      flash[:error] = "Email address can't blank"
      redirect_to new_message_path
      return
    end
    fails_send = []
    pass_send = []
    emails = email_params.split(";")
    emails.each_with_index do |email,index|
      user = User.find_by_email(email)
      if user.nil?
        fails_send<< email
        if (index+1) == emails.count
          has_sended_output(fails_send, pass_send)
          redirect_to new_message_path
        end
      else
        message = current_user.messages.new(to_id: user.id, content:content_params)
        if message.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hieu2@gmail.com"]]
INSERT INTO "messages" ("to_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["to_id", 1], ["content", "asdf asjdflkajsdkfsa fa"], ["user_id", 2], ["created_at", "2016-03-17 16:15:03.595934"], ["updated_at", "2016-03-17 16:15:03.595934"]]

  def show
    @message = Message.find_by_id(params[:id])
    @user = User.find_by_id(@message.user_id)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

    def set_read? message
      unless message.notification.read
        message.notification.read = true
        message.notification.save!
---
INSERT INTO "notifications" ("user_id", "event_id", "event_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["event_id", 4], ["event_type", "Message"], ["created_at", "2016-03-17 16:15:03.609593"], ["updated_at", "2016-03-17 16:15:03.609593"]]
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", "t"], ["updated_at", "2016-03-18 13:22:14.844875"], ["id", 4]]