app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email:params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hieu@gmail.com"]]